20240509T143103--kdoc-169-『ユーザーストーリーマッピング』__draft_book.org
:properties:
:ID: 20240509T143103
:end:
#+title:      KDOC 169: 『ユーザーストーリーマッピング』
#+date:       [2024-05-09 Thu 14:31]
#+filetags:   :draft:book:
#+identifier: 20240509T143103

# (denote-rename-file-using-front-matter (buffer-file-name) 0)
# (save-excursion (while (re-search-backward ":draft" nil t) (replace-match "")))
# (flush-lines "^\\#\s.+?")

# ====ポリシー。
# 1ファイル1アイデア。
# 1ファイルで内容を完結させる。
# 常にほかのエントリとリンクする。
# 自分の言葉を使う。
# 参考文献を残しておく。
# 文献メモの場合は、感想と混ぜないこと。1つのアイデアに反する
# ツェッテルカステンの議論に寄与するか
# 頭のなかやツェッテルカステンにある問いとどのようにかかわっているか
# エントリ間の接続を発見したら、接続エントリを追加する。カード間にあるリンクの関係を説明するカード。
# アイデアがまとまったらアウトラインエントリを作成する。リンクをまとめたエントリ。
# エントリを削除しない。古いカードのどこが悪いかを説明する新しいカードへのリンクを追加する。
# 恐れずにカードを追加する。無意味の可能性があっても追加しておくことが重要。

# ====永久保存メモのルール
# 自分の言葉で書く
# 後から読み返して理解できる
# 他のメモと関連付ける
# ひとつのメモにひとつのことだけを書く
# メモの内容は1枚で完結させる
# 論文の中に組み込み、公表できるレベルである

# ====価値があるか
# その情報がどういった文脈で使えるか
# どの程度重要な情報か
# そのページのどこが本当に必要な部分なのか

* この文書のステータス
- 作成
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))
- レビュー
  - [ ] <署名>
# (progn (kill-line -1) (insert (format "  - [X] %s 貴島" (format-time-string "%Y-%m-%d"))))

# 関連をつけた。
# タイトルがフォーマット通りにつけられている。
# 内容をブラウザに表示して読んだ(作成とレビューのチェックは同時にしない)。
# 文脈なく読めるのを確認した。
# おばあちゃんに説明できる。
# いらない見出しを削除した。
# タグを適切にした。
# すべてのコメントを削除した。
* 概要
[[https://www.oreilly.co.jp/books/9784873117324/][ユーザーストーリーマッピング]]は、ストーリーマッピングの手法を解説する本である。アジャイルによって分割されたストーリーの全体像を把握するテクニックを解説している。
* メモ
- 火星探査機の話(p4)
- 完璧なドキュメントを書こうとするのを阻止しなければならない、と主張する。何かを書いて、言葉と絵で会話をして、共通理解を築いていく(p6)
- 「ストーリー」の由来は、何を書くべきかではなく、どのように使うか。開発でストーリーを使っても、言葉と絵を使って会話していなければ間違っている、という
- 世界を観察すると、不満、怒り、当惑している人々がいることに気づく。彼らを手助けできそうなアイデアを「要件」とよぶ(p11)
  - タブレットで困り果てながらも練習する祖母を思い出した
- 欲しいのはソフトウェアやアウトプットではない。それを使って得られる成果、だという(p11)
- より多く、早く作ることではなく，より少なく作るのが重要だという(p14)
- ストーリーマップを作るときのスローガンは、「話して記録」だという(p25)
- 膨大な作業が必要なことが明確になる。そこから現実的な量に削り、優先順位をつけていく
- MVPの定義(p57)
  - 望まれる成果を実現できる最小限のソリューション

* 関連
# 関連するエントリ。なぜ関連させたか理由を書く。意味のあるつながりを意識的につくる。
# この事実は自分のこのアイデアとどう整合するか。
# この現象はあの理論でどう説明できるか。
# ふたつのアイデアは互いに矛盾するか、互いを補っているか。
# いま聞いた内容は以前に聞いたことがなかったか。
# メモ y についてメモ x はどういう意味か。
