20240509T143103--kdoc-169-『ユーザーストーリーマッピング』__draft_book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>KDOC 169: 『ユーザーストーリーマッピング』</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">KDOC 169: 『ユーザーストーリーマッピング』</h1>

<div id="outline-container-org834d068" class="outline-2">
<h2 id="org834d068"><a href="#org834d068">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org834d068">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd54930c" class="outline-2">
<h2 id="orgd54930c"><a href="#orgd54930c">概要</a></h2>
<div class="outline-text-2" id="text-orgd54930c">
<p>
<a href="https://www.oreilly.co.jp/books/9784873117324/">ユーザーストーリーマッピング</a>は、ストーリーマッピングの手法を解説する本である。アジャイルによって分割されたストーリーの全体像を把握するテクニックを解説している。
</p>
</div>
</div>
<div id="outline-container-org2d207dd" class="outline-2">
<h2 id="org2d207dd"><a href="#org2d207dd">メモ</a></h2>
<div class="outline-text-2" id="text-org2d207dd">
<ul class="org-ul">
<li>火星探査機の話(p4)</li>
<li>完璧なドキュメントを書こうとするのを阻止しなければならない、と主張する。何かを書いて、言葉と絵で会話をして、共通理解を築いていく(p6)</li>
<li>「ストーリー」の由来は、何を書くべきかではなく、どのように使うか。開発でストーリーを使っても、言葉と絵を使って会話していなければ間違っている、という</li>
<li>世界を観察すると、不満、怒り、当惑している人々がいることに気づく。彼らを手助けできそうなアイデアを「要件」とよぶ(p11)
<ul class="org-ul">
<li>タブレットで困り果てながらも練習する祖母を思い出した</li>
</ul></li>
<li>欲しいのはソフトウェアやアウトプットではない。それを使って得られる成果、だという(p11)</li>
<li>より多く、早く作ることではなく，より少なく作るのが重要だという(p14)</li>
<li>ストーリーマップを作るときのスローガンは、「話して記録」だという(p25)</li>
<li>膨大な作業が必要なことが明確になる。そこから現実的な量に削り、優先順位をつけていく</li>
<li>MVPの定義(p57)
<ul class="org-ul">
<li>望まれる成果を実現できる最小限のソリューション</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4dad886" class="outline-2">
<h2 id="org4dad886"><a href="#org4dad886">関連</a></h2>
<div class="outline-text-2" id="text-org4dad886">
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
